powermax_threads20_result_200508/thread_20_dram_sr_3400_3.txt
shm_addr = 7900
shm_addr = 7900
shm_addr = 7900
[...]
======================================
 all_ops == 2000000
 test_time == 18.171392
 Throughput == 110063.114592
 ======================================
20        Threads
1         Connections per thread
100000    Requests per client


ALL STATS
=========================================================================
Type         Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
-------------------------------------------------------------------------
Sets            0.00          ---          ---      0.00000         0.00 
Gets       110101.87    110101.87         0.00      0.17800    114820.72 
Waits           0.00          ---          ---      0.00000          --- 
Totals     110101.87    110101.87         0.00      0.17800    114820.72 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
---
GET       0.025         0.00
GET       0.026         0.00
GET       0.027         0.00
GET       0.028         0.00
GET       0.029         0.01
GET       0.030         0.01
GET       0.031         0.02
GET       0.032         0.02
GET       0.033         0.02
GET       0.034         0.02
GET       0.035         0.02
GET       0.036         0.02
GET       0.037         0.02
GET       0.038         0.03
GET       0.039         0.03
GET       0.040         0.03
GET       0.041         0.03
GET       0.042         0.03
GET       0.043         0.03
GET       0.044         0.03
GET       0.045         0.03
GET       0.046         0.03
GET       0.047         0.04
GET       0.048         0.04
GET       0.049         0.04
GET       0.050         0.04
GET       0.051         0.04
GET       0.052         0.04
GET       0.053         0.04
GET       0.054         0.04
GET       0.055         0.04
GET       0.056         0.04
GET       0.057         0.04
GET       0.058         0.04
GET       0.059         0.04
GET       0.060         0.04
GET       0.061         0.04
GET       0.062         0.05
GET       0.063         0.05
GET       0.064         0.05
GET       0.065         0.05
GET       0.066         0.05
GET       0.067         0.05
GET       0.068         0.05
GET       0.069         0.05
GET       0.070         0.05
GET       0.071         0.05
GET       0.072         0.05
GET       0.073         0.06
GET       0.074         0.06
GET       0.075         0.06
GET       0.076         0.06
GET       0.077         0.06
GET       0.078         0.06
GET       0.079         0.07
GET       0.080         0.07
GET       0.081         0.07
GET       0.082         0.07
GET       0.083         0.07
GET       0.084         0.07
GET       0.085         0.07
GET       0.086         0.07
GET       0.087         0.07
GET       0.088         0.08
GET       0.089         0.08
GET       0.090         0.08
GET       0.091         0.08
GET       0.092         0.08
GET       0.093         0.08
GET       0.094         0.08
GET       0.095         0.09
GET       0.096         0.09
GET       0.097         0.09
GET       0.098         0.09
GET       0.099         0.10
GET       0.100         0.11
GET       0.110         0.13
GET       0.120         0.28
GET       0.130         1.58
GET       0.140         5.83
GET       0.150        16.76
GET       0.160        27.51
GET       0.170        53.21
GET       0.180        74.47
GET       0.190        81.26
GET       0.200        86.01
GET       0.210        90.01
GET       0.220        93.18
GET       0.230        95.74
GET       0.240        96.91
GET       0.250        97.27
GET       0.260        97.46
GET       0.270        97.62
GET       0.280        97.76
GET       0.290        97.88
GET       0.300        98.10
GET       0.310        98.59
GET       0.320        99.19
GET       0.330        99.63
GET       0.340        99.84
GET       0.350        99.92
GET       0.360        99.95
GET       0.370        99.97
GET       0.380        99.97
GET       0.390        99.97
GET       0.400        99.97
GET       0.410        99.98
GET       0.420        99.98
GET       0.430        99.98
GET       0.440        99.98
GET       0.450        99.98
GET       0.460        99.99
GET       0.470        99.99
GET       0.480        99.99
GET       0.490        99.99
GET       0.500        99.99
GET       0.510        99.99
GET       0.520        99.99
GET       0.530        99.99
GET       0.540        99.99
GET       0.550        99.99
GET       0.560        99.99
GET       0.570        99.99
GET       0.580        99.99
GET       0.590        99.99
GET       0.600        99.99
GET       0.610        99.99
GET       0.620        99.99
GET       0.630        99.99
GET       0.640        99.99
GET       0.650        99.99
GET       0.660        99.99
GET       0.670        99.99
GET       0.680        99.99
GET       0.690        99.99
GET       0.710        99.99
GET       0.720        99.99
GET       0.730        99.99
GET       0.740        99.99
GET       0.750        99.99
GET       0.760        99.99
GET       0.790        99.99
GET       0.820        99.99
GET       0.850        99.99
GET       0.870        99.99
GET       0.890        99.99
GET       0.900       100.00
GET       0.910       100.00
GET       0.920       100.00
GET       0.950       100.00
GET       0.960       100.00
GET       0.970       100.00
GET       0.980       100.00
GET       0.990       100.00
GET       1.000       100.00
GET       1.100       100.00
GET       1.200       100.00
---