powermax_threads20_result_200508/thread_20_dram_sw_3400_0.txt
shm_addr = 7900
shm_addr = 7900
shm_addr = 7900
[...]
======================================
 all_ops == 2000000
 test_time == 23.207408
 Throughput == 86179.378585
 ======================================
20        Threads
1         Connections per thread
100000    Requests per client


ALL STATS
=========================================================================
Type         Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
-------------------------------------------------------------------------
Sets        86151.93          ---          ---      0.22900     90264.98 
Gets            0.00         0.00         0.00      0.00000         0.00 
Waits           0.00          ---          ---      0.00000          --- 
Totals      86151.93         0.00         0.00      0.22900     90264.98 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.032         0.00
SET       0.033         0.00
SET       0.034         0.00
SET       0.037         0.00
SET       0.038         0.00
SET       0.039         0.00
SET       0.040         0.00
SET       0.042         0.00
SET       0.043         0.00
SET       0.044         0.00
SET       0.045         0.00
SET       0.046         0.00
SET       0.047         0.01
SET       0.048         0.01
SET       0.049         0.01
SET       0.050         0.01
SET       0.051         0.01
SET       0.052         0.01
SET       0.053         0.01
SET       0.054         0.01
SET       0.055         0.01
SET       0.056         0.01
SET       0.057         0.01
SET       0.058         0.01
SET       0.059         0.01
SET       0.060         0.01
SET       0.061         0.01
SET       0.062         0.01
SET       0.063         0.01
SET       0.064         0.01
SET       0.065         0.02
SET       0.066         0.02
SET       0.067         0.02
SET       0.068         0.02
SET       0.069         0.02
SET       0.070         0.02
SET       0.071         0.02
SET       0.072         0.02
SET       0.073         0.02
SET       0.074         0.02
SET       0.075         0.02
SET       0.076         0.02
SET       0.077         0.02
SET       0.078         0.02
SET       0.079         0.02
SET       0.080         0.03
SET       0.081         0.03
SET       0.082         0.03
SET       0.083         0.03
SET       0.084         0.03
SET       0.085         0.03
SET       0.086         0.03
SET       0.087         0.03
SET       0.088         0.03
SET       0.089         0.03
SET       0.090         0.03
SET       0.091         0.03
SET       0.092         0.03
SET       0.093         0.03
SET       0.094         0.03
SET       0.095         0.03
SET       0.096         0.03
SET       0.097         0.03
SET       0.098         0.03
SET       0.099         0.03
SET       0.100         0.04
SET       0.110         0.04
SET       0.120         0.04
SET       0.130         0.04
SET       0.140         0.04
SET       0.150         0.05
SET       0.160         0.05
SET       0.170         0.22
SET       0.180         0.58
SET       0.190         0.72
SET       0.200         0.93
SET       0.210         9.06
SET       0.220        60.52
SET       0.230        78.87
SET       0.240        83.66
SET       0.250        89.68
SET       0.260        92.51
SET       0.270        94.58
SET       0.280        97.47
SET       0.290        98.60
SET       0.300        99.03
SET       0.310        99.38
SET       0.320        99.54
SET       0.330        99.61
SET       0.340        99.64
SET       0.350        99.66
SET       0.360        99.67
SET       0.370        99.68
SET       0.380        99.68
SET       0.390        99.68
SET       0.400        99.68
SET       0.410        99.69
SET       0.420        99.69
SET       0.430        99.69
SET       0.440        99.71
SET       0.450        99.80
SET       0.460        99.89
SET       0.470        99.92
SET       0.480        99.94
SET       0.490        99.96
SET       0.500        99.96
SET       0.510        99.97
SET       0.520        99.98
SET       0.530        99.98
SET       0.540        99.98
SET       0.550        99.99
SET       0.560        99.99
SET       0.570        99.99
SET       0.580        99.99
SET       0.590        99.99
SET       0.600        99.99
SET       0.610        99.99
SET       0.620        99.99
SET       0.630        99.99
SET       0.640        99.99
SET       0.650        99.99
SET       0.660        99.99
SET       0.670        99.99
SET       0.680        99.99
SET       0.690        99.99
SET       0.700        99.99
SET       0.710        99.99
SET       0.720        99.99
SET       0.730        99.99
SET       0.740        99.99
SET       0.760        99.99
SET       0.770        99.99
SET       0.780        99.99
SET       0.790        99.99
SET       0.800       100.00
SET       0.810       100.00
SET       0.820       100.00
SET       0.830       100.00
SET       0.840       100.00
SET       0.850       100.00
SET       0.870       100.00
SET       0.880       100.00
SET       0.890       100.00
SET       0.900       100.00
SET       0.910       100.00
SET       0.920       100.00
SET       0.930       100.00
SET       0.960       100.00
SET       1.000       100.00
SET       1.100       100.00
SET       1.800       100.00
SET       2.100       100.00
SET       2.200       100.00
SET       2.300       100.00
SET       2.400       100.00
---
---